#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`failure`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

module.k8s_deployments.random_password.auth_secret: Refreshing state... [id=none]
module.k8s_deployments.random_password.keycloak: Refreshing state... [id=none]
module.rdb_databases["strategytool"].random_password.this: Refreshing state... [id=none]
module.rdb_databases["keycloak"].random_password.this: Refreshing state... [id=none]
module.k8s_cluster.scaleway_cockpit_source.traces: Refreshing state... [id=fr-par/018ea9b9-674f-4b0d-910c-6d2a37b7a5cb]
data.scaleway_iam_application.strategytool: Reading...
module.k8s_cluster.scaleway_cockpit_source.metrics: Refreshing state... [id=fr-par/d2b33152-2412-4d63-a4d6-669acfccb55f]
module.k8s_cluster.scaleway_cockpit_source.logs: Refreshing state... [id=fr-par/d5327eb3-0d5a-4327-b944-9894cc79512f]
module.k8s_cluster.scaleway_cockpit_token.grafana_alloy: Refreshing state... [id=fr-par/36356088-835d-4a3f-b1e5-d87348ad34d3]
scaleway_domain_zone.dev[0]: Refreshing state... [id=dev.dotstory.de]
scaleway_object_bucket.upload: Refreshing state... [id=fr-par/strategytool-upload]
data.scaleway_iam_application.cert_manager: Reading...
module.k8s_cluster.scaleway_vpc_private_network.this: Refreshing state... [id=fr-par/dffb52b6-2a4c-4623-9044-8dc37c8949af]
data.scaleway_iam_application.strategytool: Read complete after 1s [id=fff61d3e-5eda-4feb-86fc-8e279f38f1b9]
data.scaleway_iam_application.kapsule: Reading...
data.scaleway_domain_zone.root: Reading...
scaleway_iam_api_key.strategytool: Refreshing state... [id=SCW5PS2PWRWZMZXE4N28]
data.scaleway_iam_application.cert_manager: Read complete after 1s [id=d6b54a86-4e7b-49ad-805f-a0d8ab2bb564]
scaleway_iam_api_key.cert_manager: Refreshing state... [id=SCW2M0XRCQKMHXR9VJMC]
module.k8s_cluster.scaleway_k8s_cluster.this: Refreshing state... [id=fr-par/f636851c-96ef-414c-a39e-cd89c083f599]
scaleway_rdb_instance.dev: Refreshing state... [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4]
data.scaleway_iam_application.kapsule: Read complete after 0s [id=48b5a810-07bc-40b0-b208-ceb70c9f96fc]
scaleway_iam_api_key.registry_password: Refreshing state... [id=SCWV1PBFXRG419GE6HQH]
data.scaleway_domain_zone.root: Read complete after 0s [id=.dotstory.de]
scaleway_domain_record.mail: Refreshing state... [id=ac8ad8b3-58a1-46f0-ae96-db72b078f6e6]
scaleway_tem_domain.this: Refreshing state... [id=fr-par/0d097f01-517e-4717-aa53-059b5dd8130c]
scaleway_domain_record.dkim: Refreshing state... [id=d43ae056-f879-4601-b6e9-5c9a70d2961a]
scaleway_domain_record.spf: Refreshing state... [id=82244a99-9ad1-4acb-ac7f-ef1e3969f5cf]
scaleway_domain_record.dmarc: Refreshing state... [id=400bd24e-b8fe-4e64-bb61-28029b93953d]
module.k8s_cluster.scaleway_k8s_pool.this: Refreshing state... [id=fr-par/dd4a13b6-94ae-4fb6-adea-6023d7acb93f]
module.rdb_databases["keycloak"].scaleway_rdb_user.this: Refreshing state... [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4/keycloak]
module.rdb_databases["strategytool"].scaleway_rdb_user.this: Refreshing state... [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4/strategytool]
module.rdb_databases["strategytool"].scaleway_rdb_database.this: Refreshing state... [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4/strategytool]
module.rdb_databases["keycloak"].scaleway_rdb_database.this: Refreshing state... [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4/keycloak]
module.rdb_databases["strategytool"].data.scaleway_rdb_instance.this: Reading...
module.rdb_databases["keycloak"].data.scaleway_rdb_instance.this: Reading...
module.k8s_cluster.null_resource.kubeconfig: Refreshing state... [id=8389456854455782582]
module.k8s_deployments.kubernetes_role_binding_v1.strategytool: Refreshing state... [id=default/strategytool]
module.k8s_deployments.kubernetes_service_v1.strategytool: Refreshing state... [id=default/strategytool]
module.k8s_deployments.kubernetes_role_v1.strategytool: Refreshing state... [id=default/strategytool]
module.k8s_deployments.kubernetes_secret_v1.keycloak: Refreshing state... [id=default/keycloak-credentials]
module.k8s_deployments.kubernetes_ingress_v1.strategytool: Refreshing state... [id=default/strategytool]
module.k8s_deployments.kubernetes_secret_v1.image_pull_secret: Refreshing state... [id=default/registry-credentials]
module.rdb_databases["keycloak"].data.scaleway_rdb_instance.this: Read complete after 1s [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4]
module.k8s_deployments.kubernetes_service_v1.keycloak: Refreshing state... [id=default/keycloak]
module.rdb_databases["strategytool"].data.scaleway_rdb_instance.this: Read complete after 1s [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4]
module.k8s_deployments.helm_release.grafana_alloy: Refreshing state... [id=grafana-alloy]
module.k8s_deployments.helm_release.cert_manager[0]: Refreshing state... [id=cert-manager]
module.rdb_databases["strategytool"].scaleway_rdb_privilege.this: Refreshing state... [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4/strategytool/strategytool]
module.rdb_databases["keycloak"].scaleway_rdb_privilege.this: Refreshing state... [id=fr-par/3e6b983d-2617-4e4b-bbea-4e58e03f1ac4/keycloak/keycloak]
scaleway_object_bucket_acl.upload: Refreshing state... [id=fr-par/strategytool-upload/private]
module.k8s_deployments.helm_release.traefik_ingress: Refreshing state... [id=traefik-ingress]
module.k8s_deployments.kubernetes_deployment_v1.keycloak: Refreshing state... [id=default/keycloak]
module.k8s_deployments.kubernetes_job_v1.migrate: Refreshing state... [id=default/migrate]
data.keycloak_openid_client.strategytool: Reading...
data.keycloak_openid_client.strategytool: Read complete after 1s [id=899c22af-b2c6-4084-a1fe-26d2510386a2]
module.k8s_deployments.kubernetes_deployment_v1.strategytool: Refreshing state... [id=default/strategytool]
module.k8s_deployments.helm_release.cert_manager_webhook[0]: Refreshing state... [id=scaleway-webhook]
module.k8s_deployments.data.kubernetes_service_v1.traefik_ingress: Reading...
module.k8s_deployments.data.kubernetes_service_v1.traefik_ingress: Read complete after 1s [id=kube-system/traefik-ingress]
scaleway_domain_record.strategytool[0]: Refreshing state... [id=cf7c67e6-737f-4363-a533-3332b77bc743]
scaleway_domain_record.keycloak[0]: Refreshing state... [id=9b9c7973-9655-4544-96d8-9ee680b6a01f]
scaleway_domain_record.strategytool_wildcard[0]: Refreshing state... [id=aa1e985a-4a1e-45f0-8bd3-c82dd5b3376b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.k8s_deployments.kubectl_manifest.cluster_issuer[0] will be created
  + resource "kubectl_manifest" "cluster_issuer" {
      + api_version             = "cert-manager.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterIssuer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "letsencrypt"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: letsencrypt
            spec:
              acme:
                email: daniel@knotdots.de
                privateKeySecretRef:
                  name: issuer-account-key
                server: https://acme-v02.api.letsencrypt.org/directory
                solvers:
                - dns01:
                    webhook:
                      groupName: acme.scaleway.com
                      solverName: scaleway
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.k8s_deployments.kubectl_manifest.compress_middleware[0] will be created
  + resource "kubectl_manifest" "compress_middleware" {
      + api_version             = "traefik.containo.us/v1alpha1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Middleware"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "test-compress"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: traefik.containo.us/v1alpha1
            kind: Middleware
            metadata:
              name: test-compress
            spec:
              compress: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @freudenberg, Action: `pull_request`*